# THIS FILE IS AUTOMATICALLY GENERATED
# Project: D:\Proyectos\3_Embedded Systems\Cypress\CypressProjects\Digital_Dimmer.cydsn\Digital_Dimmer.cyprj
# Date: Tue, 07 May 2024 23:20:48 GMT
#set_units -time ns
create_clock -name {CyRouted1} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/dsi_in_0}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFClk} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFClk} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySysClk} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {timer_clock} -source [get_pins {ClockBlock/hfclk}] -edges {1 5 11} -nominal_period 104.16666666666666 [list [get_pins {ClockBlock/udb_div_0}]]


# Component constraints for D:\Proyectos\3_Embedded Systems\Cypress\CypressProjects\Digital_Dimmer.cydsn\TopDesign\TopDesign.cysch
# Project: D:\Proyectos\3_Embedded Systems\Cypress\CypressProjects\Digital_Dimmer.cydsn\Digital_Dimmer.cyprj
# Date: Tue, 07 May 2024 23:20:41 GMT
